#Использовать asserts
#Использовать autumn
#Использовать httpbin
#Использовать collectionos
#Использовать 1connector
#Использовать "../src/shared"

Перем _HttpBin; // HttpBin
Перем _СканерИспользованийПакета; // СканерИспользованийПакета

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта()
	
КонецПроцедуры

&ПередВсеми
Процедура ПередВсеми() Экспорт

	// HttpBin
	_HttpBin = Новый HttpBin(, 3434);
	_HttpBin.УстановитьТаймаутЗапуска(20);
	_HttpBin.УстановитьРасположениеКонтроллеров("./tests/fixtures/api-mocks");
	_HttpBin.Запустить();
		
	// Autumn
	ЗначенияДеталек = Новый Соответствие();
	ЗначенияДеталек.Вставить("litros.github.АдресAPI", _HttpBin.URL());
	ЗначенияДеталек.Вставить("litros.github.БазоваяЗадержкаПовтораМс", 0);
	ЗначенияДеталек.Вставить("litros.github.ЛимитВызововПоискаКода", 1000);
	ЗначенияДеталек.Вставить("litros.github.ИнтервалЛимитаПоискаКодаМс", 1000);
	ЗначенияДеталек.Вставить("litros.github.МаксимальноеОжиданиеЛимитаПоискаКодаМс", 50);

	СоветДругогоМастера = Новый СоветДругогоМастера();
	СоветДругогоМастера.ЗначенияДеталек(ЗначенияДеталек);

	Поделка = Новый Поделка(СоветДругогоМастера);
	Поделка.ЗапуститьПриложение();

	_СканерИспользованийПакета = Поделка.НайтиЖелудь("СканерИспользованийПакета");

КонецПроцедуры

&ПередКаждым
Процедура ПередКаждым() Экспорт
	ОтключитьЛимитПоискаКода();
КонецПроцедуры

&ПослеВсех
Процедура ПослеВсех() Экспорт
	Если _HttpBin <> Неопределено Тогда
		_HttpBin.Остановить();
	КонецЕсли;
КонецПроцедуры

&Тест
&Параметры(0, 0, 0)
&Параметры(5, 2, 0)
&Параметры(5, 0, 2)
&Параметры(5, 2, 1)
&Параметры(5, 5, 0)
&Параметры(150, 20, 30)
&Параметры(150, 20, 0)
&Параметры(150, 0, 30)
&Параметры(150, 150, 0)
&Параметры(1000, 50, 60)
&Параметры(1500, 30, 70)
Процедура ТестДолжен_НайтиРепозиторииБезЛимитов(КоличествоЭлементов, КоличествоОсновныхРепозиториев, КоличествоФорков) Экспорт

	// Подготовка
	ИмяПакета = СформироватьИмяПакета(КоличествоЭлементов, КоличествоОсновныхРепозиториев, КоличествоФорков);

	// Действие
	РезультатПоиска = _СканерИспользованийПакета.НайтиРепозитории(ИмяПакета);
	Репозитории = РезультатПоиска.Данные;

	// Утверждение
	Ожидаем.Что(РезультатПоиска.Успех).ЭтоИстина();
	Ожидаем.Что(РезультатПоиска.Завершено).ЭтоИстина();
	Ожидаем.Что(РезультатПоиска.Сообщение).Не_().Заполнено();
	Ожидаем.Что(Репозитории).ИмеетДлину(КоличествоОсновныхРепозиториев + КоличествоФорков);

	Статистика = СтатистикаНайденнызРепозиториев(Репозитории);
	Ожидаем.Что(Статистика.КоличествоОсновныхРепозиториев, "Количество основных репозиториев").Равно(КоличествоОсновныхРепозиториев);
	Ожидаем.Что(Статистика.КоличествоФорков, "Количество форков").Равно(КоличествоФорков);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьСохранениеПромежуточныхРезультатов() Экспорт
	
	// Подготовка
	ИмяПакета = "totalCount_200_repoCount_150_forkCount_50"; // 2 страницы по 100
	УстановитьЛимит(2); // 2 страницы основных репозиториев

	// Действие
	РезультатПоиска = _СканерИспользованийПакета.НайтиРепозитории(ИмяПакета);
	Ожидаем.Что(РезультатПоиска.Успех).ЭтоИстина();
	Ожидаем.Что(РезультатПоиска.Завершено).ЭтоЛожь();
	Ожидаем.Что(РезультатПоиска.Сообщение).Не_().Заполнено();

	УстановитьЛимит(2); // 2 страницы форков
	РезультатПоиска = _СканерИспользованийПакета.НайтиРепозитории(ИмяПакета);
	Репозитории = РезультатПоиска.Данные;
		
	// Утверждение
	Ожидаем.Что(РезультатПоиска.Успех).ЭтоИстина();
	Ожидаем.Что(РезультатПоиска.Завершено).ЭтоИстина();
	Ожидаем.Что(РезультатПоиска.Сообщение).Не_().Заполнено();
	
	Статистика = СтатистикаНайденнызРепозиториев(Репозитории);
	Ожидаем.Что(Репозитории).ИмеетДлину(200);
	Ожидаем.Что(Статистика.КоличествоОсновныхРепозиториев, "Количество основных репозиториев").Равно(150);
	Ожидаем.Что(Статистика.КоличествоФорков, "Количество форков").Равно(50);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьИнтерактивноеСоздание() Экспорт

	// Подготовка
	ИмяПакета = "totalCount_80_repoCount_40_forkCount_30";
	
	// Действие
	Сканер = Новый СканерИспользованийПакета("token", _HttpBin.URL());
	РезультатПоиска = Сканер.НайтиРепозитории(ИмяПакета);
	
	// Утверждение
	Ожидаем.Что(РезультатПоиска.Успех).ЭтоИстина();
	Ожидаем.Что(РезультатПоиска.Завершено).ЭтоИстина();
	Ожидаем.Что(РезультатПоиска.Сообщение).Не_().Заполнено();
	Ожидаем.Что(РезультатПоиска.Данные).ИмеетДлину(70);

	Статистика = СтатистикаНайденнызРепозиториев(РезультатПоиска.Данные);
	Ожидаем.Что(Статистика.КоличествоОсновныхРепозиториев, "Количество основных репозиториев").Равно(40);
	Ожидаем.Что(Статистика.КоличествоФорков, "Количество форков").Равно(30);

КонецПроцедуры

Функция СтатистикаНайденнызРепозиториев(Репозитории)

	ОсновныеРепозитории = Новый МножествоСоответствие();
	Форки = Новый МножествоСоответствие();

	Для Каждого Описание Из Репозитории Цикл 
		Если Описание.ЭтоФорк Тогда
			Форки.Добавить(Описание.ПолноеИмя);
		Иначе
			ОсновныеРепозитории.Добавить(Описание.ПолноеИмя);
		КонецЕсли;
	КонецЦикла;

	Возврат Новый Структура("КоличествоОсновныхРепозиториев, КоличествоФорков", ОсновныеРепозитории.Количество(), Форки.Количество());
	
КонецФункции

Функция СформироватьИмяПакета(КоличествоЭлементов, КоличествоОсновныхРепозиториев, КоличествоФорков)

	ФорматнаяСтрокаЧисла = "ЧН=0; ЧГ=";

	Возврат СтрШаблон(
		"totalCount_%1_repoCount_%2_forkCount_%3",
		Формат(КоличествоЭлементов, ФорматнаяСтрокаЧисла),
		Формат(КоличествоОсновныхРепозиториев, ФорматнаяСтрокаЧисла),
		Формат(КоличествоФорков, ФорматнаяСтрокаЧисла));

КонецФункции

Процедура УстановитьЛимит(Лимит)
	Результат = КоннекторHTTP.Get(_HttpBin.URL(СтрШаблон("search/limits/%1", Формат(Лимит, "ЧН=0; ЧГ="))));
	Если Результат.КодСостояния <> 200 Тогда
		ВызватьИсключение "Не удалось установить лимит";
	КонецЕсли;
КонецПроцедуры

Процедура ОтключитьЛимитПоискаКода()
	Результат = КоннекторHTTP.Get(_HttpBin.URL(СтрШаблон("search/limits/disable")));
	Если Результат.КодСостояния <> 200 Тогда
		ВызватьИсключение "Не удалось отключить лимит";
	КонецЕсли;
КонецПроцедуры
